cases/square2D_VIV_multiprocessing/env01/0/motionScale
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointScalarField;
    location    "10";
    object      motionScale;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
37650
(
0
0
0
0
0
0
0
0
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
    }
    outlet
    {
        type            calculated;
    }
    syms
    {
        type            calculated;
    }
    front1
    {
        type            calculated;
    }
    front2
    {
        type            calculated;
    }
    middle1
    {
        type            calculated;
    }
    middle2
    {
        type            calculated;
    }
    back1
    {
        type            calculated;
    }
    back2
    {
        type            calculated;
    }
    cylinder
    {
        type            calculated;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
